---
kind: method
id: M:Autodesk.Revit.UI.ITemporaryGraphicsHandler.OnClick(Autodesk.Revit.UI.TemporaryGraphicsCommandData)
source: html/607c4055-f72c-501d-122d-0580c87527d0.htm
---
# Autodesk.Revit.UI.ITemporaryGraphicsHandler.OnClick Method

Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager .

## Syntax (C#)
```csharp
void OnClick(
	TemporaryGraphicsCommandData data
)
```

## Parameters
- **data** (`Autodesk.Revit.UI.TemporaryGraphicsCommandData`) - The context data of the click event.